"""
保存全局变量
"""


# 下载文件夹路径: 文件选择对话框默的认打开路径
DOWNLOADS_PATH = "~/Downloads"

# 桌面路径: 用于保存处理后的文件
DESKTOP_PATH = "~/Desktop"

# 最小时间间隔 (毫秒) : 用于判断按键是否冲突, 区间首尾会各扩展该值避免冲突
MIN_TIME_GAP = 198

# 7K各轨道的X坐标范围 (最小值, 最大值) , 对应轨道0到6 (第一到第七轨道) 
TRACK_RANGES_7 = [
    (0, 73),    # 第1列轨道
    (74, 146),  # 第2列轨道
    (147, 219), # 第3列轨道
    (220, 292), # 第4列轨道
    (293, 365), # 第5列轨道
    (366, 438), # 第6列轨道
    (439, 511)  # 第7列轨道
]

# 6K各轨道的X坐标范围 (最小值, 最大值) , 对应轨道0到5 (第一到第六轨道)
TRACK_RANGES_6 = [
    (0, 85),     # 6K第1列轨道
    (86, 170),   # 6K第2列轨道
    (171, 255),  # 6K第3列轨道
    (256, 341),  # 6K第4列轨道
    (342, 426),  # 6K第5列轨道
    (427, 511)   # 6K第6列轨道
]

# (0, 1, 2, 4, 5, 6)的随机序列
RANDOM_SEQUENCE_6 = [
    (0, 6, 4, 1, 2, 5),
    (0, 2, 5, 6, 1, 4),
    (1, 5, 0, 4, 2, 6),
    (1, 4, 2, 5, 6, 0),
    (2, 6, 1, 0, 5, 4),
    (2, 5, 4, 1, 0, 6),
    (4, 0, 6, 2, 5, 1),
    (4, 1, 5, 6, 0, 2),
    (5, 2, 6, 4, 1, 0),
    (5, 6, 1, 2, 0, 4),
    (6, 4, 2, 0, 5, 1),
    (6, 1, 0, 5, 4, 2)
]